[
    {
        "id": "1805431065297162",
        "title": "Patch 01.003.201",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1805431065297162",
        "author": "Åtnjutslångsamt",
        "content": "[p]Issuing an Emergency Hot Fix from High Command[/p][h1]Overview[/h1][list][*][p]Crash Fix[/p][/*][/list][h2]Fix[/h2][list][*][p]Fix for the host crashing the game for other players when planting the CQC-1 One True Flag stratagem[/p][/*][/list]",
        "publishedAt": "2025-07-16T09:01:13Z"
    },
    {
        "id": "1805065414359608",
        "title": "PATCH 01.003.200",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1805065414359608",
        "author": "Åtnjutslångsamt",
        "content": "[p]Freedoms greetings Helldivers![/p][p]Release Captain Carlberg coming to you this democratic Tuesday with an update from high command[/p][p][/p][h1]🌍 Overview[/h1][list][*][p]Balancing[/p][/*][*][p]Mission Fixes[/p][/*][*][p]Weapon Fixes[/p][/*][*][p]Miscellaneous Fixes[/p][/*][/list][p]\n\n[/p][h1][/h1][h2]⚖️ Balancing[/h2][p]\n[/p][h2]General[/h2][h3]Helldiver[/h3][list][*][p]Reduced the time it takes for the Helldiver to regain control after ragdolling from 0.8 to 0.5 sec[/p][/*][*][p]Increased chest injury bleed damage from 1 to 10. Chest injuries now cause more noticeable damage, as the previous value of 1 was so low it appeared to have no effect[/p][/*][/list][h3][b]CQC-1 One True Flag[/b] [/h3][list][*][p]Thanks to some groundbreaking military research into pointier flag tips, the flag can now be proudly planted directly into enemies—dead or alive—ensuring the eternal colors of Super Earth are never tainted, only quenched by the blood of its foes. Absolute Democracy[/p][/*][/list][h3]Primary weapons[/h3][p][b]AR-32 Pacifier[/b][/p][list][*][p]Stun duration increased from 1.5 to 3 sec [/p][/*][/list][list][*][p]Starting magazines increased from 5 to 6[/p][/*][/list][list][*][p]Max amount of magazines increased from 7 to 8[/p][/*][*][p]Slight increase in stun value applied to enemies[/p][/*][/list][p]\n[/p][p][b]SMG-72 Pummeler[/b][/p][list][*][p]Stun duration increased from 1.5 to 3 sec[/p][/*][*][p]Slight increase in stun value applied to enemies[/p][/*][/list][p]\n[/p][p][b]ARC-12 Blitzer[/b][/p][list][*][p]Slight increase in stun value applied to enemies[/p][/*][/list][p]\n[/p][p][b]R-2124 Constitution[/b][/p][list][*][p]Bayonet stagger strength increased from 20 to 25[/p][/*][/list][p]\n[/p][p][b]R-2 Amendment[/b] [/p][list][*][p]Bayonet stagger strength increased from 20 to 25[/p][/*][/list][p]\n[/p][h3]Sidearms[/h3][p][b]P-92 Warrant[/b][/p][list][*][p]Now also locks-on to Large sized enemies[/p][/*][/list][p]\n[/p][h3]Throwables[/h3][p][b]G-109 Urchin[/b][/p][list][*][p]Stagger strength increased from 0 to 50[/p][/*][*][p]It now staggers and affects Large sized enemies[/p][/*][/list][p]\n[/p][p][b]G-10 Incendiary[/b][/p][list][*][p]The amount of fuel has been increased in the grenade, resulting in longer-lasting fire duration[/p][/*][/list][p]\n[/p][p][b]G-13 Incendiary impact[/b][/p][list][*][p]The amount of fuel has been increased in the grenade, resulting in a longer-lasting fire duration[/p][/*][/list][p]\n\n[/p][h2]Stratagems[/h2][p][b]A/FLAM-40 Flame sentry[/b][/p][list][*][p]Fire damage resistance increased from 0 to 95%[/p][/*][/list][list][*][p]Cooldown reduced from 150 to 100 sec[/p][/*][/list][p]\n[/p][p][b]GL-52 De-Escalator[/b][/p][list][*][p]Slight increase in stun value applied to enemies[/p][/*][/list][h2]Boosters[/h2][p][b]Firebomb Hellpod[/b][/p][list][*][p]Now affects the Hellpods default explosion as well [/p][/*][*][p]Stagger strength decreased from 80 to 15 to prevent ragdolling players[/p][/*][*][p]Demolition strength decreased from 40 to 20 because we now correctly also additively apply the normal Hellpod explosion[/p][/*][/list][p][b]Stun Pods[/b][/p][list][*][p]Now affects the Hellpods default explosion as well[/p][/*][*][p]Stagger strength decreased from 80 to 15 to prevent ragdolling players[/p][/*][*][p]Demolition strength decreased from 40 to 20 because we now correctly also additively apply the normal Hellpod explosion[/p][/*][/list][p]\n[/p][h2]Enemies[/h2][h3]General[/h3][list][*][p]It’s now easier to put Large to Massive sized enemies on fire[/p][/*][/list][h3]Terminids[/h3][p][b]Warrior[/b] [/p][list][*][p]Damage needed to gib Warriors increased from 500 to 750 damage[/p][/*][*][p]This is how much damage is needed to explode the body without leaving a corpse behind[/p][/*][/list][p]\n[/p][h3]Automatons[/h3][p][b]Scout strider[/b][/p][list][*][p]Legs armor decreased from 3 to 2[/p][/*][/list][list][*][p]Legs durable resistance has been increased[/p][/*][/list][h3]Illuminates[/h3][p][b]Overseer variants[/b][/p][list][*][p]Unarmored Torso healthzone armor decreased from 2 to 1[/p][/*][/list][p]\n[/p][h1]🔧 Fixes[/h1][p]Weapons Stratagems & Boosters[/p][list][*][p]Fixed an issue with the R-2124 Constitution playing audio during the wrong instances[/p][/*][*][p]Fixed an issue with the draw and holster speed with the Gunslinger Armor Passive[/p][/*][*][p]Fixed an issue with ranged weapon grips after dropping the Entrenchment Tool[/p][/*][/list][p][/p][p]Enemies[/p][list][*][p]Fixed an issue where status effect damage were attempting to apply more times than intended[/p][/*][/list][h1]Missions[/h1][list][*][p]Fixed an issue that prevented stratagems from working correctly on Terminate Illegal Broadcast objectives[/p][/*][*][p]Fixed an issue with bad enemy pathing on military uplink objectives[/p][/*][*][p]Fixed an issue for the terminal and drop off point, where they became inaccessible during the Retrieve Recon Craft Intel objective[/p][/*][/list][h1]Miscellaneous Fixes[/h1][list][*][p]Fixed an issue in first person view where some armors resulted in visible obstructions around the shoulder while using a high Field Of View[/p][/*][*][p]Fixed an issue during map generation that could result in missing terrain features[/p][/*][*][p]Fixed fall animations occasionally playing before victory poses[/p][/*][*][p]Extended some fonts to handle Bengali characters in player names[/p][/*][*][p]Fixed an error that caused some enemy models to appear in lower quality[/p][/*][*][p]Fixed an issue to prevent accidentally triggering jump packs or climbing on supply pods while using the interact button on controller[/p][/*][*][p]Fixed an issue where exiting the chat was leaving players unarmed[/p][/*][*][p]Fixed an issue with aiming during the draw emote[/p][/*][*][p]Fixed issues when exiting First Person View using emotes[/p][/*][/list][p][/p][h2][url=\"https://arrowhead.zendesk.com/hc/en-us/articles/15916898652700--HELLDIVERS-2-Known-Issues\" style=\"button\"]KNOWN ISSUES[/url][/h2]",
        "publishedAt": "2025-07-15T09:00:38Z"
    },
    {
        "id": "1803527891960756",
        "title": "Helldivers 2 Control Group Warbond launches July 17!",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1803527891960756",
        "author": "The Baskinator",
        "content": "[p]Attention, Helldivers! The Ministry of Defense Research & Development team has just declassified the following information for immediate release. \n[/p][p]You have been cleared to field test a new range of experimental weapons built from acquired alien technology. R&D scientists have completed the Control Group Premium Warbond* for deployment to your Super Destroyer![/p][p][/p]\n[previewyoutube=L8FKZG2lPBw;full][/previewyoutube]\n\n[p][b]Weapons & Stratagems[/b][/p][p][img src=\"{STEAM_CLAN_IMAGE}/44156989/0d739b6cba663b47c61717eac2331c9fb47872f0.jpg\"][/img][/p][p]First up, in the primary weapon category, is the VG-70 Variable, a seven-barrelled volley gun with three different firing modes: Auto, which has three selectable RPM values; Volley, which fires a single shot from each barrel at once; and Total, which fires all remaining ammunition in one go. [i]Researchers noted that using the Total firing mode with a lot of ammunition may result in bodily harm to the user.\n[/i][/p][p][img src=\"{STEAM_CLAN_IMAGE}/44156989/d620b7f5c4b228ae9afac118dec5a83d4f2d9ba4.jpg\"][/img][/p][p]Also in need of field testing is the new G-31 Arc grenade. The lightweight G-31 bounces while discharging electricity that strikes enemies (and Helldivers) in proximity.[/p][p][/p][p][img src=\"{STEAM_CLAN_IMAGE}/44156989/225acfa48acc6bc4369973ca60d9ddea14bbb67c.jpg\"][/img][/p][p]The next declassified item is the PLAS-45 Epoch support weapon which charges plasma into a focused sphere which is then fired. [i]This weapon is ready for battlefield use, but additional research data suggests that it can explode if overcharged. No safe mode is available[/i]. But we're sure you can handle it, Helldiver. This is what field testing is all about!\n\n[img src=\"{STEAM_CLAN_IMAGE}/44156989/8143ffa46adfbf833637cd921649f8cb4e9a7a2d.jpg\"][/img][/p][p]Next up in offensive technology is the A/LAS-98 Laser Sentry. For this sentry, the ammunition canisters on standard turrets have been replaced with a supersized heatsink, allowing the potential for infinite laser firing. [i]However, R&D would like to remind users that the turret can overheat and explode if the laser is continuously active with no cooldown.[/i][/p][p][/p][p][img src=\"{STEAM_CLAN_IMAGE}/44156989/a377332350462d22bda94e11e2a4dbf8f7de5cc9.jpg\"][/img][/p][p]Perhaps the most significant and exciting development from the Ministry of Defense is the new LIFT-182 Warp Pack stratagem. R&D has harnessed the power of Dark Fluid to generate a (somewhat) stable wormhole on demand. Once the wormhole is active, wearers can teleport short distances with no cooldown between jumps. In practice, the wearer is pulled into the singularity, dematerialized, and rematerialized again in a new location. [/p][p][/p][p][i]The head of R&D noted that the dematerialization process can be somewhat painful, and that users should bear in mind that the wormhole cannot maintain integrity for extended periods–each jump will further destabilize it, and the wearer may experience death should the singularity fully collapse[/i]. A small price to pay for ultra-convenient traversal![/p][p][/p][p][b]Armors & More[/b][/p][p][img src=\"{STEAM_CLAN_IMAGE}/44156989/68f7f95799887345ddba4c7f8f9d958b46b5ec06.jpg\"][/img][/p][p]And don’t forget about proper personal protective equipment! Good field testing involves enforcing safety protocols, which is why we’re outfitting Control Group with two new sets of armor designed to provide adequate battlefield protection. For medium armor, we’ve included the AD-26 Bleeding Edge that will allow for protection and greater ease of movement combined. But for more dangerous experiments, there’s also the AD-49 Apollonian heavy armor that’s meant to assist you with the perils of evaluating all this new equipment. \n[/p][p]Each armor set looks professionally stylish with the coordinating capes, Conductor of Brilliance and Over Artifice Triumphant, and both armor sets feature a new and exciting passive: Adreno-Defibrillator! After you take lethal damage and the Adreno-Defibrillator detects that the user has collapsed, it activates and revives the user to full health. [i]R&D did indicate that the Adreno-Defibrillator only has enough charge for one use to bring the user to maximum health, and the user will begin losing health continually after activating it.[/i]\n[/p][p]In addition to all this, R&D is including new player cards to match the Conductor of Brilliance and Over Artifice Triumphant capes, and we’re giving you access to a new emote to assist in testing: Protect Eardrums. Covering your ears is the leading method to prevent noise-induced hearing loss. Safety first!\n[/p][p]And, finally, with great scientific discovery comes much hard work and sacrifice, Helldivers, and that’s why we want to recognize your valiant field testing efforts of the Control Group Warbond with a special title: Exemplary Subject. Wear this to show your squad that you got in on the ground floor of this advanced technology!\n[/p][p]You’ve been recruited into the Control Group, divers. Report to R&D for field testing on July 17!\n[/p][p][img src=\"{STEAM_CLAN_IMAGE}/44156989/0ba76e503f0115cf58183f0b1ce60a8f38d919dd.jpg\"][/img][/p][p]*[i]Requires base game, paid purchase of Super Credits, and game progression to unlock.[/i][/p]",
        "publishedAt": "2025-07-10T13:06:21Z"
    },
    {
        "id": "1803527891703582",
        "title": "Warbond Token Announcement",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1803527891703582",
        "author": "The Baskinator",
        "content": "[h2][b]Warbond Token - incoming![/b][/h2][p]Greetings Helldivers,[/p][p]We’ve been listening to our community and we’re here to let you know of an upcoming update to the HELLDIVERS 2 editions.[/p][h3]Introducing the Warbond Token*![/h3][p][img src=\"{STEAM_CLAN_IMAGE}/44156989/67839d257db7d89c662b7e414065c7770c95bfbd.jpg\"][/img][/p][p]The upcoming, new Warbond Token\n[/p][p][b][i]What is a Warbond Token?[/i][/b] we hear you ask: A Warbond Token will allow players who purchase the [i]HELLDIVERS 2: Super Citizen Edition[/i] or [i]HELLDIVERS 2: Super Citizen Edition Upgrade[/i] to unlock any Premium Warbond released in HELLDIVERS 2. The Warbond Token will replace the ‘Steeled Veterans Warbond’ within both special editions. We will be introducing the new token into these two editions on August 26th, 2025.[/p][p][b]But why?[/b][/p][p]Prior to now players could accidentally double up purchases on the ‘Steeled Veterans Warbond’ in the game and with the [i]Super Citizen Edition Upgrade[/i]. We never want players to buy things twice and not get the value of what they paid for![/p][p][b]Can I purchase a Warbond Token by itself?[/b][/p][p]There are no plans for the Warbond Token to exist as a standalone product. Players will still be able to access and purchase any Premium Warbond within the game as it has been to date.[/p][p][b]When does this happen? Can I get it now? I’ve been meaning to upgrade for ages![/b][/p][p]The update will happen August 26th, 2025. If you own a [i]HELLDIVERS 2 Standard Edition[/i] and have bought ‘Steeled Veterans Warbond’ already then we recommend waiting until August to purchase the [i]Super Citizen Edition Upgrade[/i]. You will be able to choose to unlock a different Warbond from ‘Steeled Veterans’![/p][p][b]Do I need to do anything?[/b][/p][list][*][p]If you already own the [i]Super Citizen Edition[/i] then congratulations you don’t need to do anything![/p][/*][*][p]If you own a [i]HELLDIVERS 2 Standard Edition[/i] and have bought ‘Steeled Veterans Warbond’ already then we recommend waiting until August to purchase the [i]Super Citizen Edition Upgrade. [/i]You will then be able to unlock a different Warbond.[/p][/*][*][p]If you own [i]HELLDIVERS 2 Standard Edition[/i] and have not bought ‘Steeled Veterans Warbond’, then we highly recommend taking a look at the [i]Super Citizen Edition Upgrade[/i], you can choose to buy this now and get the ‘Steeled Veterans Warbond’, or wait until August and choose to unlock any of the Premium Warbonds currently available in HELLDIVERS 2.[/p][/*][*][p]If you don’t own any edition of HELLDIVERS 2 then we suggest purchasing as soon as possible or risk being reported to High Command. Your team needs you Helldivers![/p][/*][/list][p] [b]How will the Warbond Token appear in the game?[/b][/p][p]After purchasing the updated [i]Super Citizen Edition[/i] or [i]Super Citizen Edition Upgrade[/i] (post 26th August), the Warbond Token will be granted to your Helldivers 2 account after you login to the game for the first time and reach the shiphub. [/p][p]To check if you have a Warbond Token in your inventory, open the game menu and select any Premium Warbond. If the button in the bottom right says \"Claim Premium Warbond\" instead of \"Buy Premium Warbond\", the token is available.[/p][p]- To use the token, click \"Claim Premium Warbond\". A \"Confirm Purchase\" prompt will appear. Confirm it to unlock the selected Premium Warbond.[/p][p][/p][p][img src=\"{STEAM_CLAN_IMAGE}/44156989/eb6a35e8d4ccd4b9f8bd527ce9f5591f8510f9aa.jpg\"][/img]\nIn-game confirmation[/p][p]\n[b]What will the options look like?[/b][/p][list][*][p][i]HELLDIVERS 2 Standard Edition[/i][/p][/*][*][p][i]HELLDIVERS 2 Super Citizen Edition[/i] – will be replacing the Steeled Veterans Warbond with a Warbond Token[/p][/*][*][p][i]HELLDIVERS 2 Super Citizen Edition Upgrade[/i] – will be replacing the Steeled Veterans Warbond with a  Warbond Token.[/p][/*][/list][p][/p][p][/p][p]Legal:[/p][p][i]*Not available for standalone purchase.[/i][/p]",
        "publishedAt": "2025-07-02T12:51:17Z"
    },
    {
        "id": "1802893906885230",
        "title": "Patch 01.003.104",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1802893906885230",
        "author": "Åtnjutslångsamt",
        "content": "[p]Freedoms greetings Helldivers![/p][p]Release Captain Carlberg here with a small update this fine Tuesday![/p][p][/p][h1]🌍 [b]Overview[/b][/h1][list][*][p]General Weapons fixes[/p][/*][*][p]Leviathan[/p][/*][/list][p][/p][h1]🔧 [b]Fixes[/b][/h1][p]\n[/p][p][b]Weapons and Stratagems[/b][/p][list][*][p]Fixed weapons being unable to fire after stimming while using a mounted weapon. [/p][/*][/list][list][*][p]P-92 Warrant bullets no longer penetrate when ricocheting[/p][/*][*][p]Fixed guard dog text issues[/p][/*][/list][p]\n[/p][p][b]Enemies[/b][/p][p]Leviathans[/p][p]We have heard your feedback and are attempting to balance Leviathans to more manageable levels. [/p][p][/p][list][*][p]The Leviathans no longer cause ragdolling and deal less impulse damage to vehicles[/p][/*][*][p]Adjusted spawn rates, so you encounter less per mission[/p][/*][*][p]Added an additional 1 second delay between shots for target locking[/p][/*][*][p]Leviathan cannons can now be destroyed\n\n[/p][/*][/list][h1][b]Miscellaneous Fixes[/b][/h1][list][*][p]Fixed a bug that caused mission items to disappear when entering vehicles [/p][/*][*][p]Fix for chat interactions causing weapon switches while using a mounted weapon, emotes and victory poses[/p][/*][*][p]Fixed weapon grip issues and melee attack issues after using stims or emotes[/p][/*][/list]",
        "publishedAt": "2025-06-24T09:00:46Z"
    },
    {
        "id": "1802354289717990",
        "title": "🛠️ PATCH 01.003.103 ⚙️",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1802354289717990",
        "author": "Miitchimus",
        "content": "[h2]🌍 [b]Overview[/b][/h2][list][*][p]Battle For Super Earth commemorative cape! \nPlease note: Capes may take several hours to complete deployment to all Helldivers.\nThe cape is available for all [b]active players[/b] during the Battle for Super Earth event, from May 13 to June 2.[/p][/*][*][p]Balance adjustments to Shrieker Mega Nests and the Leviathan[/p][/*][*][p]Fixes galore! Including a fix for the crash in the weapon customisation screen[/p][/*][/list][p][/p][h2]⚖️ [b]Balancing[/b][/h2][list][*][p]Increased the health of Mega Shrieker nests. This change was made to make the objective more challenging and provide more varied solutions to destroying them. [/p][/*][*][p]Leviathans now have a shorter sight range and will mark their target with light a few seconds before they fire. This change gives players a fair warning before being fired upon.[/p][/*][/list][p][/p][h2]🔧 [b]Fixes[/b][/h2][p][/p][h3][b]Crash Fixes, Hangs and Soft-locks:[/b][/h3][list][*][p]Fixed crash that occurred when changing between menus in weapon customisation too quickly.[/p][/*][*][p]Fixed crash that would occur for players fighting bots with a poor connection.[/p][/*][*][p]Fixed a freeze when generating bug city missions.[/p][/*][*][p]Fixed crash that could occur when taking down Illuminate Overships. [/p][/*][/list][h3][b]Weapons and Stratagems[/b][/h3][list][*][p]Fixed Weapons with selectable ammo (Recoilless Rifle, Autocannon, etc) having their icons overwritten by the Warrant’s “Guided/Unguided” Mode.[/p][/*][*][p]P-92 Warrant: will no longer lock some targets when in unguided mode.[/p][/*][*][p]P-92 Warrant: Fixed an issue where lock-on would be difficult in some environments.[/p][/*][*][p]P-92 Warrant: Fixed some Z-fighting with lights on the weapon.[/p][/*][*][p]P-92 Warrant: Corrected animations for the pistol's sight, it should now fold away nicely when in unguided mode.[/p][/*][*][p]AX/LAS-5 “Guard Dog” Rover: will no longer return to backpack to “reload.”[/p][/*][*][p]AR-32 Pacifier: Fixed spent casing not ejecting from the ejection port. [/p][/*][*][p]Added Videos for the K-9 Guard Dog and Gl-52 De-Escalator.[/p][/*][*][p]One True Flag: Fixed an issue where planting the flag would cause objective items to clip through the ground. [/p][/*][/list][h3][b]Enemies[/b][/h3][list][*][p]Fixed some issues where enemies could clip into certain terrain elements. \nNote: We aren’t done resolving all of these issues and continue to investigate. Please keep the reports coming![/p][/*][/list][h3][b]Missions[/b][/h3][list][*][p]Fixed an issue where horde missions would spawn at Difficulties lower than 5, which would break some functionality.[/p][/*][*][p]Fixed an issue where certain bug missions would not spawn during operations.[/p][/*][/list][h3][b]Miscellaneous Fixes[/b][/h3][list][*][p]Resolved issue with vehicle skins not having a scroll bar and increased total number of skins that can be displayed.[/p][/*][*][p]All cities will now display in the city availability UI.[/p][/*][*][p]Fixed a bug that would show 0 player count on some cities.[/p][/*][*][p]Added more logging to track desyncs and crashes.[/p][/*][*][p]Fixed Borderline Justice armours to be more accurate to their stats, e.g. slight improvement to draw speed, etc.[/p][/*][/list][p][/p][h2][b]🧠KNOWN ISSUES[/b][/h2][p][url=\"https://arrowhead.zendesk.com/hc/en-us/articles/15916898652700--HELLDIVERS-2-Known-Issues\"]https://arrowhead.zendesk.com/hc/en-us/articles/15916898652700--HELLDIVERS-2-Known-Issues[/url][/p][p][/p][p]\n[/p]",
        "publishedAt": "2025-06-17T09:01:27Z"
    },
    {
        "id": "1802354289556614",
        "title": "Patch 01.003.102",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1802354289556614",
        "author": "Åtnjutslångsamt",
        "content": "[p]Freedoms greetings Helldivers! Release Captain Carlberg here with a small update[/p][list][*][p]General Hot Fix for missions before the weekend. [/p][/*][/list][p][/p][p]We are still working on more of the known issues but these will be part of a bigger Hot Fix.[/p][p][/p][p]That will be all and thank you for your services in the name of Super Earth[/p][p][/p]",
        "publishedAt": "2025-06-12T09:00:33Z"
    },
    {
        "id": "1801617199551135",
        "title": "Patch 01.003.101",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1801617199551135",
        "author": "Åtnjutslångsamt",
        "content": "[p]Salutations Helldivers![/p][p]Another Tuesday another transmission from Super Earth High Command. Without further ado please pay attention to the following message.[/p][p][/p][h1][b]Overview[/b][/h1][list][*][p]Stealth Detection Update[/p][/*][*][p]Crash Fixes[/p][/*][*][p]Balancing[/p][/*][*][p]Mission fixes[/p][/*][*][p]Miscellaneous fixes[/p][/*][/list][h2][b]Balancing[/b][/h2][p][/p][h3][b]General[/b][/h3][p]The Ministry of Humanity has issued an amendment to its Combat Mobility Safety Guidelines, now permitting Helldivers to self-administer stims while in mid-dive, an act previously categorized in the same risk zone as “running with scissors” and “juggling live grenades”[/p][p][b]Primary weapons[/b][/p][p]R-2 Amendment[/p][list][*][p]Increased ergonomics from 35 to 50[/p][/*][/list][p]\n[/p][p][b]Sidearms[/b][/p][p]P-2 Peacemaker[/p][list][*][p]Increased starting magazines from 4 to 5[/p][/*][*][p]Increased max spare magazines from 6 to 8[/p][/*][*][p]Increased damage from 75 to 85[/p][/*][*][p]Increased durable damage from 15 to 25[/p][/*][/list][p]\n[/p][p][b]Armor Passives[/b][/p][p]Integrated Explosives[/p][list][*][p]Now also increases initial inventory and holding capacity of grenades by +2[/p][/*][/list][p]Unflinching[/p][p]This passive has been adjusted to better reflect the core doctrine of the [i]Truth Enforcers[/i] Warbond—relentless pursuit, battlefield awareness, and overwhelming presence[/p][list][*][p]Now also increases armor rating by 25[/p][/*][*][p]Markers placed on the map will generate a radar scan every 2.0s, revealing nearby hostiles[/p][/*][/list][p]\n[/p][h3]Enemies[/h3][p][b]General[/b][/p][p]Stealth Detection Update:[/p][p]Enemies will no longer automatically detect you when you're near Terminid spawners or spawners that generate flying enemies. Instead, these spawners will now only activate if an enemy has already identified you as a target.[/p][list][*][p]Previously, simply being within 200 meters of certain spawner types—such as flying enemy spawners, Stalker lairs, or inside Terminid locations—would trigger immediate enemy spawns and reveal your location. This update shifts detection to a more logical, line-of-sight or alert-based system, reducing arbitrary auto-detection mechanics and improving stealth gameplay[/p][/*][/list][p]\n[/p][p]As a result of these changes, Automaton Fabricators now spawn enemies more consistently, ensuring smoother pacing and engagement balance[/p][p]\n[/p][h3]Objectives[/h3][p]Take Down Overship[/p][list][*][p]The Planetary Defense Cannon now causes an appropriate amount of damage when shooting at Leviathans[/p][/*][/list][h3]Illuminate[/h3][p]Harvester[/p][list][*][p]Their health has been rebalanced to make them easier to destroy using anti-tank weapons, particularly when aiming at their head[/p][/*][/list][p]Overseers[/p][list][*][p]Reduced the frequency of Elevated Overseers spawning during Prevent Invasion Foothold missions[/p][/*][*][p]Overseers can now occasionally spawn from landed dropships at outposts, adding variety to their battlefield presence[/p][/*][/list][p]Leviathan[/p][list][*][p]Projectile damage was reduced from 1500 to 350. The intent is to ensure Helldivers are still eliminated on direct impact, while preventing instant destruction of Exosuits and FRVs[/p][/*][*][p]Explosion damage and radius from turret shots have been increased to maintain lethality through area denial[/p][/*][/list][h3]Automatons[/h3][p]Factory Strider[/p][list][*][p]Slightly increased the health of its feet. It should no longer be destroyed by a single GR-8 Recoilless Rifle shot to the legs[/p][/*][/list][h2][b]Fixes[/b][/h2][p][b]Crash Fixes, Hangs and Soft-locks:[/b][/p][list][*][p]Fixed a crash that could happen after any player disconnects[/p][/*][*][p]Fixed some crashes that were caused by browsing different weapon attachments[/p][/*][/list][p]\n[/p][p][b]Weapons and Stratagems[/b][/p][list][*][p]Fixed RS-422 Railgun scope's screen not displaying the heat level correctly[/p][/*][*][p]Entrenchment tool's stamina cost now properly matches other melee weapons[/p][/*][*][p]Fixed an issue where melee attacks inside shield relays were not registering properly[/p][/*][/list][p]\n[/p][p][b]Enemies[/b][/p][list][*][p]Fixed two cases where the Stingray enemy would appear to stop or teleport on death[/p][/*][/list][p][b]Missions[/b][/p][list][*][p]Fixed an issue with the 'Take Down Overship' mission where the Overship explosion did not always trigger for client players[/p][/*][*][p]Fixed a rare issue in 'Take Down Overship' where the Overship could get destroyed and not trigger the objective completion[/p][/*][*][p][/p][/*][*][p]Fixed an issue with the 'Deploy Seismic Probe' mission that could make it incompletable if you completed a Lidar side objective while a seismic probe had been called down[/p][/*][*][p]Fixed an issue with the drill not falling correctly for clients on the 'Nuke Nursery' mission[/p][/*][*][p]Fixed an issue with super samples failing to spawn in cities[/p][/*][/list][p][b]Miscellaneous Fixes[/b][/p][list][*][p]Fixed a bug that was causing Helldivers to slide while using the Lockstep march emote[/p][/*][*][p]Fixed an issue with friendly & enemy pathing around the Shuttlebay location[/p][/*][*][p]Fix a bug that was causing the Helldiver to hold pickups as weapons when switching between weapons right after picking up an item[/p][/*][*][p]Fixed missing attachments for SEAF soldiers[/p][/*][*][p]Game will now show error message if resources cannot be loaded correctly[/p][/*][*][p]Fixed a flickering issue that sometimes would occur in the loadout menu's Helldiver previews[/p][/*][*][p]Fixed jitter while interacting with the Armory[/p][/*][/list][h1][url=\"https://arrowhead.zendesk.com/hc/en-us/articles/15916898652700--HELLDIVERS-2-Known-Issues\"]Known Issues[/url][/h1]",
        "publishedAt": "2025-06-10T09:00:38Z"
    },
    {
        "id": "1801617199401543",
        "title": "Use the full Force of Law in the streets on June 12!",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1801617199401543",
        "author": "The Baskinator",
        "content": "[p]When it comes to Super Earth, you are the law–the final word on freedom and Managed Democracy in our streets. You are the keeper of the peace and the deliverer of justice, but you need to step up your gear before you go out on patrol. That’s why the Ministry of Defense has approved the release of the Force of Law Premium Warbond1 on June 12![/p][p][/p][previewyoutube=\"uHuOJoeXdYA;full\"][/previewyoutube][p][/p][p]First, let’s talk gear. The AR-32 Pacifier, a large capacity assault rifle, is the last word in defense against enemies roaming the colonies. Combine it with the new G-109 Urchin stun grenade, which attaches to the perp and dispenses electrical pulses until they’re incapacitated, and you can handle any size squid assembly.[/p][p][/p][p][img src=\"{STEAM_CLAN_IMAGE}/44156989/39c7126a50dcd6bcd2736834fa08759aaf226eb8.jpg\"][/img][/p][p][img src=\"{STEAM_CLAN_IMAGE}/44156989/5256c256d6d3d700a52094d9f8fe1e335dfec585.jpg\"][/img][/p][p]But hold on–you’re still going to need some backup, diver. We can’t think of a better companion than the AX/ARC-3 “Guard Dog” K-9. Loyal to its core, the arc-powered K-9 will get between you and any threat to your authority. Just be wary of the occasional (accidental) friendly bite.[/p][p][/p][p][img src=\"{STEAM_CLAN_IMAGE}/44156989/bcbb144fb47ad8350586fe2bafae6bd007853c88.jpg\"][/img][/p][p]We’re also including access to the GL-52 De-Escalator support weapon, a grenade launcher that fires high-powered arc grenades. The negotiations will be short and shocking when you call this one in.[/p][p][/p][p][img src=\"{STEAM_CLAN_IMAGE}/44156989/2fb70bf342dc98782a1d3e2b6bf9d15a17743acc.jpg\"][/img][/p][p]This isn’t an undercover job, either, so you need to get some gear that lets citizens, SEAF, and squids alike know you’re on the beat. Nothing inspires a sense of safety and obedience quite like the sight of a Helldiver wearing the BP-20 Correct Officer medium armor, with its protective padding and roomy pouches.[/p][p][/p][p]But maybe you want to be first on the scene, which means you need something lightweight. In that case, try the BP-32 Jackboot, a light armor packing fewer pouches, but more panache with an official-looking tailored jacket and sturdy pauldrons.[/p][p][/p][p][img src=\"{STEAM_CLAN_IMAGE}/44156989/e7ecd746946e3f2ce30910afb98e4642ba26587f.jpg\"][/img][/p][p]Both armors come with the Ballistic Padding passive that grants the wearer higher resistance to chest damage, explosive damage, and all damage from bleeding. These armors also pair well with either the Miranda’s Legacy or the Mother Eagle’s Wings capes, and their matching player cards, in coordinating blue and gold color schemes.[/p][p][/p][p][img src=\"{STEAM_CLAN_IMAGE}/44156989/012beba489ab720ea460b000bc765d7723fb663b.jpg\"][/img][/p][p]Force of Law also includes new patterns! Watch them scatter when your paddy wagon, the FRV, rolls down the street with the True Blue pattern, also available for your Exosuits and Hellpods. Speaking of Hellpods, be sure to equip the new booster–Stun Pods–which hotwires your drops to shock nearby suspects into a stupor.[/p][p][/p][p][img src=\"{STEAM_CLAN_IMAGE}/44156989/11db45414ada3b85252a60b4d9c97cdc517e1abf.jpg\"][/img][/p][p]We haven’t forgotten the emotes, either. This Warbond comes with three hand signal emotes for Hold, Silence, and Group Up. Even if the mic is off, you can still organize your unit.[/p][p]And lastly, you’ve got the gun, but now you need the badge. You’ll be able to equip the Extra Judicial title, reserved only for those who protect and serve the citizens of Super Earth.[/p][p][/p][p]Be on the lookout, Helldivers: Force of Law is coming June 12! This Managed Democracy isn’t gonna enforce itself.[/p][p][/p][p][img src=\"{STEAM_CLAN_IMAGE}/44156989/c8ae43e297c4ea5940bfcf828a0e15d9ebd52936.jpg\"][/img][/p][p][i]Requires base game, paid purchase of Super Credits, and game progression to unlock.[/i][/p]",
        "publishedAt": "2025-06-05T19:39:35Z"
    },
    {
        "id": "1800991756338403",
        "title": "Patch 01.003.004",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1800991756338403",
        "author": "Åtnjutslångsamt",
        "content": "Emergency Update incoming from high command and Release Captain Carlberg.\nIt has come to our attention that the Illuminate menace has scrambled our stratagem pads input matrix resulting in loss of combat strength.\nIssuing a firmware update to all Helldivers input pads for a stronger connection to the Super Destroyer\n\n[h2]Fixes[/h2]\n[list]\n[*] Fix for fast input of stratagem commands not working correctly\n[/list]\n\nNow go forth and spread our message of Democracy\n",
        "publishedAt": "2025-05-30T09:00:41Z"
    },
    {
        "id": "1800357164562071",
        "title": "Patch 01.003.003",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1800357164562071",
        "author": "Åtnjutslångsamt",
        "content": "Freedoms Greetings Helldivers! Release Captain Carlberg here bringing you the latest updates from the Heart of Democracy.\n\n[h1]Overview[/h1]\n[list]\n[*] Bug fixes\n[*] Stability\n[*] Crash Fixes\n[*] Reinforced Epaullettes passive adjustment\n[/list]\n[h2]Armor Passive Change[/h2]\nAfter hard fought battles on super earth our Masters of Ceremony have become more grizzled and stronger. With their limbs not suffering any breakages, Helldivers adorned with these armors are finding themselves able to reload faster and punch harder.\n\nWe have been monitoring your feedback in regards to armors and their passives. We have made some adjustments to the Masters of Ceremony armors, adding 2 extra perks: \n[list]\n[*] Increased Reload Speed of primary weapons by 30%\n[*] Increased Melee Damage by 50%\n[/list]\nWe will monitor sentiment around this and assess going forward\n[h2]Fixes[/h2]\n[b]Crash Fixes, Hangs and Soft-locks:[/b]\n[list]\n[*] Fix a crash caused by browsing and interacting with the weapon customization menu too quickly\n[*] Fixed crash that could occur when exiting a 'Take down overship' mission after joining mid session\n[*] Fixed crash that could occur when joining an ongoing 'Repel invasion fleet' mission\n[*] Fix for another crash that could occur in \"Repel invasion fleet\" mission\n[*] Fix for crash related to audio\n[*] Fixed crash that could occur when dropping into a game that is transitioning back to ship\n[/list]\n[b]Enemies:[/b]\n[list]\n[*] Leviathans no longer targets power generators in defense missions\n[*] Fixed an issue with enemy pathing on the military uplink objective\n[/list]\n[b]Weapons and Stratagems[/b]\n[list]\n[*] Fix weapons not reloading after switching equipment while holding an active stratagem ball\n[*] Fixed ship damage to shields held by traitors\n[/list]\n[b]Miscellaneous Fixes[/b]\n[list]\n[*] Improved stability on city-missions featuring a Leviathan\n[*] Fixed players sometimes disconnecting when multiple Leviathans were present in the mission\n[*] Fixed issue where due to illuminate interference, time was offset incorrectly on Super Earth clocks\n[*] Fixed an issue with friendly & enemy pathing around the Shuttlebay location\n[*] Helldivers should no longer be branded traitors from civilians willingly stepping on mines\n[/list]\n",
        "publishedAt": "2025-05-27T09:02:21Z"
    },
    {
        "id": "1799817379623756",
        "title": "Helldivers, it’s time to defend the Heart of Democracy!",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1799817379623756",
        "author": "The Baskinator",
        "content": "The worst nightmare of all those who fight for Managed Democracy has been made a grim reality.\n\nDespite the valiant efforts of our Helldivers to push back the fleet, the Illuminate have reached Super Earth. Now they are swarming our cities, terrorizing citizens, and destroying our infrastructure. It’s time to rise up and take arms and fight for the precious foundations \nand soil of Democracy manifest. Helldivers, return to our planet and defend what is rightfully ours.\n\n[img]{STEAM_CLAN_IMAGE}/44156989/0ab5171ff0778b03a0fe69f80c7a0a4355a747c7.jpg[/img]\n\n[b]SUPER EARTH… OUR HOME[/b]\nThe urban sprawl of Super Earth is the site of the conflict. Fight among the towering skyscrapers and crowded streets of our home turf as the Illuminate rain down destruction all around you.\n\nInside the city biomes, you will tackle operations and work to liberate cities together, having a significant impact on planetary campaigns.\n\n[b]REPEL THE INVASION[/b]\nThe Helldivers are tasked with a new objective: to repel the Illuminate invasion by gaining ground over the squids as they fight to control areas where the fleet is landing. It won’t be a walk in the park, divers. Like a game of intergalactic tug-of-war, you will struggle against the incoming forces, gaining and losing control quickly.\n\n[img]{STEAM_CLAN_IMAGE}/44156989/1495b1111dadabf14d0eb1f081bc24c3516483ed.jpg[/img]\n\n[b]ARM THE CANNONS[/b]\nEven in the face of such danger, we are not helpless, and all is not lost. The might of Super Earth’s arsenal lies hidden beneath our peaceful, democratic streets. With your help, we must activate our Planetary Defense Cannons and take down the Illuminate fleet in a grand show of power.\n\n[img]{STEAM_CLAN_IMAGE}/44156989/934e2c97b9f1e9d2a1c3d4753de202f252f0caa8.jpg[/img]\n\n[b]CALL FOR BACKUP[/b]\nIt’s all hands on deck as you encounter SEAF troops who will help join the fight to defend our Freedom. These small squads will fight enemies on their own, or they can be ordered to follow Helldivers and provide temporary backup as you navigate toward objectives. Salute and lead them on the path to victory, divers!\n\n[img]{STEAM_CLAN_IMAGE}/44156989/51c706c8fce0a10ab4f9241503d0981de9582746.jpg[/img]\n\n[b]PROTECT CITIZENS[/b]\nHowever, you must also be aware of the many civilians still roaming the streets, fearing for their lives. They may be panicked, Helldivers, but it is your sworn duty to keep them safe and they look to you as the ultimate protectors of liberty. Remember: any civilian lives lost from friendly fire will be punished.\n\n[img]{STEAM_CLAN_IMAGE}/44156989/268a58d68d07305f7d89d1fe881aefa43cde330a.jpg[/img]\n\n[b]PREPARE FOR THE FIGHT[/b]\nLast week, we released a powerful primary weapon customization system and expanded surplus options to fight against the Illuminate as they emerged from the singularity. Now that you have learned the tactics of these new squid troops–like the Crescent Overseer and the hulking Fleshmob–you must master these tools to continue the fight on Super Earth. Use every available resource, divers, and decimate their forces!\n\n[img]{STEAM_CLAN_IMAGE}/44156989/3a139142b3847639d1c42797051c95c23291a231.jpg[/img]\n\nOur major update*, Heart of Democracy, is now live. Helldivers, to your hellpods immediately! Citizens, enlistment centers will remain open for recruitment.\n\nThe battle for Super Earth has begun. \n\n*Internet Connection and HELLDIVERS 2 game required for update.",
        "publishedAt": "2025-05-20T09:12:17Z"
    },
    {
        "id": "1799817379623310",
        "title": "Patch 01.003.002",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1799817379623310",
        "author": "Åtnjutslångsamt",
        "content": "Freedoms Greetings Helldivers, im your host Release Captain Carlberg. When humanity is at stake we bring you this update from Super Earth High Command to further your efforts in the war.\n\n[h1]Overview[/h1]\n[list]\n[*] Crash fixes\n[*] Fix for some corpses flinging the Helldivers great distances\n[*] Audio fix for the Stingray\n[*] Miscellaneous fixes\n[/list]\n[h2]Fixes[/h2]\n[b]Resolved Top Priority issues:[/b]\n[list]\n[*] Attempting to purchase a Master of Ceremony item in the Super Store when on PlayStation 5 while using the \"Quality\" visual setting will no longer change page\n[/list]\n[b]Crash Fixes, Hangs and Soft-locks:[/b]\n[list]\n[*] Fixed a crash that could occur when trying to enter the Weapon Customization menu on certain weapons\n[*] Fixed crash that could happen when killing illuminates that were about to spawn\n[/list]\n[b]Weapons and Stratagems[/b]\n[list]\n[*] Fix drone's not returning to backpack correctly\n[/list]\n[b]Miscellaneous Fixes[/b]\n[list]\n[*] Fixed an issue where Stingray strafing attack sounds could get stuck for a while\n[*] Fixed corpses of some enemies sometimes sending players flying across the map\n[/list]\n\n\n[url=https://arrowhead.zendesk.com/hc/en-us/articles/15916898652700--HELLDIVERS-2-Known-Issues]Known Issues Link[/url]",
        "publishedAt": "2025-05-20T09:00:41Z"
    },
    {
        "id": "1799817379495347",
        "title": "Patch 01.003.001",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1799817379495347",
        "author": "Åtnjutslångsamt",
        "content": "Freedoms greetings Helldivers\n[h1]Overview[/h1]\nIssuing a small Hot Fix for the following:\n[list]\n[*] Fix for players able to rapid fire stratagems and causing severe crashes\n[/list]\n",
        "publishedAt": "2025-05-16T09:01:29Z"
    },
    {
        "id": "1799088287984346",
        "title": "RED ALERT: Illuminate emerge from the Meridian Singularity!",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1799088287984346",
        "author": "The Baskinator",
        "content": "Helldivers, get to your Super Destroyers! In a surprise turn of events that even our top researchers couldn’t predict, the Illuminate have finally revealed their intentions, emerging from the Meridian singularity, and setting a course for Super Earth.\n\n[previewyoutube=bO9qCGVQsFs;full][/previewyoutube]\n\nIt’s now more important than ever that we band together and stop this salvo from destroying our liberty.\n\nNew Enemies\nThe Illuminate threat has grown, unleashing new terrors on our citizens across the galaxy. Reports indicate the Illuminate have deployed larger, more powerful enemies within their fleet, among them are the Stingray: jetfighters that provide Illuminate support from the sky, targeting Helldivers and lining up devastating strafing runs. Another new foe is the Crescent Overseer, which has the ability to lay barrages on Helldivers in cover.\n\nBut perhaps most terrifying are the reports of a failed Illuminate experiment called the Fleshmob: a Frankenstein’s monster of Voteless parts turned into a brute battlefield force that the Helldivers must work hard to destroy.\n\nThere have been sightings of other, even larger ships, though details remain unclear on their abilities. But we can’t underestimate the squids, divers, and that’s why we’re assembling our best and brightest to push them back into oblivion where they belong.\n\nWe have to gather all our resources to face this incursion and, fortunately, Super Earth’s R&D department has unlocked some powerful tools for our Helldivers, in the hopes that they will help crush the onslaught of Illuminate invaders.\n\nCustomize Your Loadout\n\nHelldivers are being given access to a robust new weapon customization feature for the bulk of our primary weapon offerings. Most primary weapons now have levels that are achievable by completing missions, which then in turn unlock new attachments obtainable through Requisition. In addition to attachments, players can also unlock patterns for their weapons. \n\n[img]{STEAM_CLAN_IMAGE}/44156989/48bdc2361d090bbdeb018836b6a208c0f1b73c19.png[/img]\n\nWhether it's tweaking sights for precision, changing color patterns, adjusting magazines for ammo capacity, muzzles to optimize weapon performance characteristics or adjusting under-barrel attachments for the handling you want, you're in command of how your weaponry performs on the battlefield. This level of individual attunement is sure to make your favorite primary best in its class.\n\nOld Warbonds, New Patterns\nWe have unlocked and deployed a stash of patterns for the FRV themed on our Viper Commandos, Freedom's Flame, Chemical Agents, and Truth Enforcers Warbonds. These will help your squad stand out to aid in battlefield coordination and collaboration. [b]This backlog of patterns will unlock for Helldivers on May 15, with the launch of the Masters of Ceremony Warbond![/b]\n\n[img]{STEAM_CLAN_IMAGE}/44156989/086ad5db38d420a0982fd909484ab56747c929ac.jpg[/img]\n\nExpanded Surplus\nThe Superstore is also getting an emergency expansion to boost your arsenals for the fight. No more waiting for items to come back into rotation–now the items you want are always available, ready to stock your ship and armor your Helldivers with items you might have missed the first time around.\n\nThe Superstore will have one rotating page featuring six different content sets that changes every 48 hours, shortening the rotation to 12 days. All the earlier Superstore items from older Warbonds are available to purchase anytime. When new Warbonds are released, one of the current rotating sets will be moved to a permanent page.\n\n[img]{STEAM_CLAN_IMAGE}/44156989/c34139153b964d44b48535b188d50f4ce3369679.png[/img]\n\nThis is the moment of truth, Helldivers. Everyone to the front lines and fight for our right to spread Managed Democracy!\n\n*Requires base game, paid purchase of Super Credits, and game progression to unlock.",
        "publishedAt": "2025-05-13T09:15:10Z"
    },
    {
        "id": "1799088287984307",
        "title": "Patch 01.003.000",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1799088287984307",
        "author": "Åtnjutslångsamt",
        "content": "Freedoms Greetings Helldivers. Release Captain Carlberg here back with another update straight from Super Earth High Command. Without further ado lets dive straight in\n\n[previewyoutube=Cca-KKScFKc;full][/previewyoutube]\n\n[h1]Overview[/h1]\n[list]\n[*] New Illuminate faction enemies\n[*] New Weapon Customizations and Progression\n[*] Crash fixes\n[*] Weapon fixes\n[*] Miscellaneous fixes\n[/list]\n[h2]Major Update[/h2]\n[b]Weapon Customization[/b]\nGear up, Helldivers—your arsenal just got personal! \nWith the new Weapon Customization system, you can now tailor your favorite weapons to match your combat style and preferences once you’ve progressed and unlocked different attachments. Whether it's tweaking sights for precision, changing color patterns, adjusting magazines for ammo capacity, muzzles to optimize weapon performance characteristics or adjusting underbarrels for the handling you want, you're in command of how your weaponry performs on the battlefield. \nTinker in the menu, customize your specific weapon configs and switch between them during the mission loadout sequence.\nIt's time to fight for Super Earth with weapons that are truly yours!\n\n[previewyoutube=A7TURE5p5Ik;full][/previewyoutube]\n\n[b]We are aware of a bug that prevents players from canceling customization with a controller. We have a fix identified and prepared for our next hotfix. In the meantime, you can save the customization and then go in and do it again.[/b]\n\n[h2]New Illuminate Enemies[/h2]\n[b]Stingray: [/b]\nJetfighters that provide Illuminate support from the sky, targeting Helldivers and lining up devastating strafing runs.\n\n[b]Crescent Overseer: [/b]\nHas the ability to lay barrages on Helldivers in cover.\n\n[b]Fleshmob:[/b]\nA failed Illuminate experiment made up of Voteless parts turned into a brute battlefield force that the Helldivers must work hard to destroy.\n\n[h2]Balancing[/h2]\n[b]Weapon balances:[/b]\n[list]\n[*] Spread\n[*] Drag\n[*] Sway\n[*] Melee weapons stamina cost\n[*] Shrapnel spawning\n[*] Fire damage\n[/list]\n[b]Spread:[/b]\nSpread refers to how much a projectile veers from the point you're aiming at when you fire. This rebalance primarily targets SMGs and sidearms, which previously had noticeably higher spread values. We've reviewed all primary, sidearm, and support weapons with the intent to significantly reduce spread overall, as it didn’t make much sense for these specific weapons to have such high inaccuracy.\n\n[b]Drag:[/b]\nDrag determines how quickly a projectile loses speed over distance, affecting its damage. We've increased drag for pistol-caliber ammunition (used in SMGs and some sidearms) to better represent its shorter, wider projectile compared to rifle rounds. As a result, these weapons will be slightly less effective at longer ranges.\n\n[b]Sway:[/b]\nSway refers to how much the weapon's aim shifts, influenced by factors like movement and stance. It represents the weapon's inertia and stability—so weapons with lower ergonomics will experience less sway, while those with higher ergonomics will have more. Sidearms will naturally have more sway than primaries due to the lack of support features like stocks. This balance patch specifically focuses on adjusting sway for primaries and sidearms.\n\n[b]Stamina Cost:[/b]\nAll melee weapons now consume less stamina when attacking, reducing the cost from 0.1 to 0.05. This change makes melee combat less punishing and allows for easier repositioning between strikes. The affected weapons include the CQC-30 Stun Baton, CQC-19 Stun Lance, CQC-5 Combat Hatchet, and the Entrenchment Tool.\n\n[b]Shrapnel spawning:[/b]\nWith this update, shrapnel will now always spawn in a full 360-degree spread, regardless of where the explosion occurs. This means weapons like the R-36 Eruptor will now more reliably hit the intended target with their shrapnel.\nIn addition, we’ve adjusted shrapnel performance against armor. Shrapnel now has reduced effectiveness at poor impact angles, to reflect its lack of design for armor penetration in such situations.\n\nThese shrapnel balance changes will impact the following weapons:\n[list]\n[*] R-36 Eruptor\n[*] G-6 Frag Grenade\n[*] AC-8 Autocannon\n[/list]\n\n[b]Balance Changes:[/b]\nArmor Penetration decreased on shrapnel projectiles from 3-3-3-0 to 3-3-2-0\n[list]\n[*] Each of these numbers represent an angle threshold, which means we’ve reduced the AP value of 3 to 2 in the last range where a shrapnel projectile would penetrate an enemy.\n[/list]\n\n[b]Frag Grenade[/b]\n[list]\n[*] Increased Shrapnel spawned from 30 to 35\n[/list]\n[b]Autocannon Flak[/b]\n[list]\n[*] Increased Shrapnel spawned from 25 to 30\n[/list]\n\n[b]Fire and Flamethrowers:[/b]\nThis update aims to better balance fire damage between direct hits (like those from flamethrowers) and burn effects over time, while also introducing scaling of fire damage depending on the size of the enemy. Previously, burn damage didn’t scale well against larger enemies, making putting them on fire feel less effective in those encounters.\n\nNow, the larger the enemy, the more damage they take while burning. However, bigger enemies will also be slightly more resistant to ignition. Additionally, direct fire damage now scales with enemy size—so large enemies like Chargers will still take roughly the same damage as before, while smaller enemies will take slightly less.\n\nWe have also increased the magazine capacity of the FLAM-66 Torcher and the FLAM-40 Flamethrower because putting stuff on fire is fun!\n\nDamage:\n[list]\n[list]\n[*] Burning damage now scales with enemy size and will do more damage over time to larger enemies\n[*] Fire direct damage also scales with enemy size. The base damage of direct fire hits has been lowered as compensation. This means that large enemies will take roughly the same amount of damage as before, while smaller enemies will take slightly less\n[/list]\nTime to ignite:\n[list]\n[*] Larger enemies now take longer to ignite\n[*] Robotic enemies are harder to set on fire than organic ones\n[*] Incendiary Ammunition and Lasers are now less effective at igniting enemies, but once they do, the resulting burn damage is more impactful thanks to the new scaling system\n[/list]\nThe Helldiver:\n[list]\n[*] The Helldiver is now slightly more resistant to being set on fire\n[*] Burn damage taken by the Helldiver remains unchanged\n[/list]\n[b]Primary weapons[/b]\nAR-23 Liberator\n[list]\n[*] Spread decreased from 4 to 2\n[/list]\nAR-23P Liberator Penetrator\n[list]\n[*] Starting magazines increased from 5 to 6\n[*] Max spare magazines increased from 7 to 8\n[/list]\nAR-23C Liberator Concussive\n[list]\n[*] Spread decreased from 24 to 4\n[/list]\nStA-52 Assault Rifle\n[list]\n[*] Spread decreased from  4 to 2\n[/list]\nAR-23A Liberator Carbine\n[list]\n[*] Spread decreased from  4 to 3\n[/list]\nAR-61 Tenderizer\n[list]\n[*] Spread decreased from 4 to 1\n[/list]\nSMG-37 Defender\n[list]\n[*] Spread decreased from 20 to 5\n[*] Drag increased from 0.3 to 0.6\n[*] Sway increased from 1 to 1.2\n[/list]\nSMG-72 Pummeler\n[list]\n[*] Spread decreased from 20 to 5\n[*] Drag increased from 0.3 to 0.6\n[*] Sway increased from 1 to 1.2\n[/list]\nMP-98 Knight\n[list]\n[*] Spread decreased from 25 to 5\n[*] Drag increased from 0.3 to 0.6\n[*] Sway increased from 1 to 1.2\n[/list]\nStA-11 SMG\n[list]\n[*] Spread decreased from 25 to 5\n[*] Drag increased from 0.3 to 0.6\n[*] Sway increased from 1 to 1.2\n[/list]\nSMG-32 Reprimand\n[list]\n[*] Spread decreased from 40 to 5\n[*] Drag increased from 0.3 to 0.6\n[/list]\nJAR-5 Dominator\n[list]\n[*] Sway decreased from 1 to 0.8\n[/list]\nR-63CS Diligence Counter Sniper\n[list]\n[*] Sway decreased from 1 to 0.8\n[/list]\nFLAM-66 Torcher\n[list]\n[*] Magazine capacity increased by 25%\n[/list]\nR-36 Eruptor\n[list]\n[*] Spread decreased from 10 to 5\n[*] Ergonomics increased from -14 to 25\n[*] Sway decreased from 1 to 0.8\n[*] Fire rate increased from 25 to 32\n[*] Fixed a bug that allowed players to cancel the Eruptor's round cycling animation, effectively increasing its fire rate\n[/list]\nThe intent with these changes: \n[list]\n[*] The improvements made to the Eruptor are designed to compensate for the removal of the reload exploit, ensuring that its overall power remains steady or even improved\n[/list]\nPLAS-39 Accelerator Rifle\n[list]\n[*] Drag decreased from 1.5 →  0.1\n[*] Is now categorized as an energy weapon in the loadout menu\n[/list]\nThe changes to drag means it wont lose speed and damage as it travels through the air and does the damage you would expect it to do\n\n[b]Sidearm Weapons[/b]\nGP-31 Ultimatum\n[list]\n[*] Is now affected by the Hellpod Optimization Booster\n[*] Explosion damage increased from 1000 to 2000\n[*] Explosion inner radius decreased from 4 to 2 m\n[*] Projectile damage decreased from 3500 to 1000\n[*] Demolition strength decreased from 50 to 40 \n[*] Sway increased from 1 to 1.3\n[/list]\nThe intent with these changes:\n[list]\n[*] We want to maintain the Ultimatum's overall power level while rebalancing how that power is delivered—shifting more of the damage from the projectile itself to the explosion. Previously, the Ultimatum behaved more like a massive kinetic projectile (similar to the 380mm shell) because of its high projectile damage and relatively weaker explosion. This update reinforces its intended identity as a powerful explosive weapon, emphasizing high explosive damage over impact force\n[*] Most heavy enemies will now die from a close hit instead of a direct hit, except for the Factory Strider\n[*] Additionally, due to its reduced demolition strength, the Ultimatum will no longer destroy Stratagem Jammer Objectives or landed Illuminate Warp Ships through their shields. However, the dropships now have health, allowing the Ultimatum to destroy them once the shield is down\n[/list]\nP-2 Peacemaker\n[list]\n[*] Decreased Spread from 30 to 10\n[*] Sway increased from 1 to 1.2\n[/list]\nP-19 Redeemer\n[list]\n[*] Decreased Spread from 35 to 10\n[*] Sway increased from 1 to 1.2\n[/list]\nP-113 Verdict\n[list]\n[*] Decreased Spread from 30 to 8\n[*] Sway increased from 1 to 1.2\n[/list]\nPLAS-15 Loyalist\n[list]\n[*] Decreased Spread from 25 to 10\n[*] Sway increased from 1 to 1.2\n[/list]\nLAS-58 Talon\n[list]\n[*] Sway increased from 1 to 1.2\n[/list]\nP-72 Crisper\n[list]\n[*] Sway increased from 1 to 1.2\n[/list]\nGP-31 Grenade Pistol\n[list]\n[*] Sway increased from 1 to 1.2\n[/list]\nLAS-7 Dagger\n[list]\n[*] Sway increased from 1 to 1.2\n[/list]\nP-11 Stim Pistol\n[list]\n[*] Sway increased from 1 to 1.2\n[/list]\nSG-22 Bushwhacker\n[list]\n[*] Sway increased from 1 to 1.3\n[/list]\nP-4 Senator\n[list]\n[*] Decreased Spread from 30 to 8\n[*] Sway increased from 1 to 1.3\n[/list]\n\n[b]Stratagems[/b]\nRS-422 Railgun\n[list]\n[*] Decreased Spread from 10 to 0.1\n[/list]\nFLAM-40 Flamethrower\n[list]\n[*] Magazine capacity increased by 30%\n[/list]\nBackpacks\nLIFT-850 Jump pack\n[list]\n[*] Increased break force on landing to make Helldivers less likely to ragdoll when landing\n[/list]\nEagles\nEagle 110mm rockets\n[list]\n[*] Stagger strength increased from 35 to 40\n[*] Increased armor penetration in certain angles\n[/list]\n\n[b]Enemies[/b]\nAutomatons\n[list]\n[*] Bunker Turret\n[*] Spread increased from 20 to 50\n[/list]\nConflagration Devastator\n[list]\n[*] Reduced damage per pellet\n[*] More pellets are now required to hit you to put you on fire\n[/list]\nAutomaton Gunship\n[list]\n[*] Body armor value reduced from 4 to 3\n[*] Main body health increased to 950 from 700\n[*] Now shoots more and the aim is slightly more accurate\n[/list]\nBulk Fabricator\n[list]\n[*] Health increased from 1500 to 5000\n[/list]\nConscripts\n[list]\n[*] There was a bug where the Conscripts reloaded after every shot, it’s now been fixed so they only reload when they’re actually out of ammo\n[/list]\nTerminids\nSpore Spewers\n[list]\n[*] Demolition level decreased from 60 to 50, making it easier to kill with heavy ordnance weapons\n[/list]\nIlluminates\n[list]\n[*] Landed Warp Ships\n[*] Will now be easier to kill with Anti-Tank weaponry once the shields are down\n[/list]\n[h2]Fixes[/h2]\n[b]Crash Fixes, Hangs and Soft-locks:[/b]\n[list]\n[*] Fixed a crash which could occur when returning to your Super Destroyer from a host parked at a planet with the Democracy Space Station in orbit, if the Democracy Space Station had just moved to a new planet\n[*] Fixed a crash when writing a specific sequence of text in the chat\n[*] Fixed a crash that could occur after partially destroying an Automaton convoy\n[*] Fixed crash when attempting to drop into a mission on Tien Kwan\n[/list]\n[b]Weapons and Stratagems[/b]\n[list]\n[*] The SMG-37 Defender does not trigger the anti tank mines anymore\n[*] Improved the effectiveness of flashlight attachments\n[*] Fixed a bug that was causing the camera to be stuck in Aim Down Sights (ADS) mode when discarding the MLS-4X Commando when utilizing that camera mode\n[*] Cancelling laser weapon reloads no longer gives them infinite ammo\n[/list]\n[b]Miscellaneous Fixes[/b]\n[list]\n[*] Fixed an issue with intermittent flickering of distant visual effects\n[*] Fixed an issue where the FRV and Helldivers embarked in it would get covered in blood after a Helldiver would attack the FRV from any passenger seat\n[*] Spore Scavengers can now properly attack\n[*] Vehicles now correctly show the appropriate enemy blood colors\n[*] Lowered the target node for the Illuminate tesla tower so that the StA-X3 W.A.S.P. Launcher can properly hit it\n[*] No longer shows the reconnect popup if the host leaves while on the Destroyer\n[*] Fixed an issue that resulted in some cases where the momentum could get reset at the end of moving emotes\n[*] Sample containers can now be properly pinged again\n[*] Corrected misaligned logo of the Borderline Justice Warbond\n[*] Fixed an issue with the illuminate Cognitive Disruptor not turning off correctly for hot joining players\n[*] Decreased a big hitch that could occur during the dropdown sequence\n[*] The game is now showing the correct amount of total samples on missions\n[*] Fixed a bug that caused held stratagems to be stuck in Helldivers hands after taking fall damage\n[*] Performance improvement in the particle subsystem\n[/list]\n[b]KNOWN ISSUES[/b]\nWe are now listing all of our known issues in the link below\n\n[url=https://arrowhead.zendesk.com/hc/en-us/articles/15916898652700--HELLDIVERS-2-Known-Issues] Known issues[/url]\n\nTransmission over.\nGo forth and spread Managed Democracy\nRelease Captain Carlberg out",
        "publishedAt": "2025-05-13T09:00:10Z"
    },
    {
        "id": "1799088287832977",
        "title": "Helldivers 2 Masters of Ceremony Marches in on May 15",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1799088287832977",
        "author": "The Baskinator",
        "content": "Attention, heroic Helldivers. \n\nTo celebrate the eradication of the Illuminate invaders, Super Earth mobilizes our most regal looking troops yet - a true celebration of our forebears. Enter the Masters of Ceremony! Wield all-new elite weaponry, capes and armours to step into the boots of Super Earth’s most decorated units. \n\n[previewyoutube=KztwRPc-y5U;full][/previewyoutube]\n\nTo start, let us look at the R-2 Amendment.\n\n[img]{STEAM_CLAN_IMAGE}/44156989/ea329b646ea12cf8cc919a20b1abffe2150ca8e0.jpg[/img]\n\nCarve through bugs like butter with an attached bayonet for close-quarter combat alongside a 20-round magazine. Perfect for vanquishing foes in style both up close and at a distance.\n\nPaired with the CQC-2 Sabre.\n\n[img]{STEAM_CLAN_IMAGE}/44156989/3ed182b846ba9ad0a7550806b632db027e3ef7cb.jpg[/img]\n\nA sabre hailing from an elegant time will inspire you to lead the charge and thrust your blade through the heart of our enemies. \n\nTo round out the parade spectacle; introducing the G-142 Pyrotech Grenade. When thrown, it will spin and shower the surrounding area in sparks before ceremoniously exploding in a ball of flames. Farewell, pitiful enemies of Super Earth.\n\n[img]{STEAM_CLAN_IMAGE}/44156989/af116e0ff7f9e28bdc270fce3855b6d185643cf2.jpg[/img]\n\nShow off your love for Managed Democracy and inspire those around you with the CQC-1 One True Flag. \n\nFeared across the galaxy and attesting to the might of Managed Democracy, this sharp symbol of freedom doubles as a spear to drive home the values of our glorious sovereignty. It brings a tear to our eyes.\n\n[img]{STEAM_CLAN_IMAGE}/44156989/99da725876fd3dbf445271b087452627bc954916.jpg[/img]\n\nSure, your killing looks great. But how do [i]you[/i] look, Helldiver? Let’s accessorize. \n\nFor formal occasions the RE-1861 Parade Commander brings old-school prestige whilst being lightweight enough to react in the heat of battle. Pair it with the Humble Regalia cape to make it shine for Democracy in red, black and gold.\n\nAfter something a little more menacing? Look no further than the RE-2310 Honorary Guard. A traditional but battle hardened armor. Pair with the Federations Embrace cape to pay honor to the glory of Super Earth and our fallen forebears. \n\n[img]{STEAM_CLAN_IMAGE}/44156989/de87ca04f35cbc5d11c442f2097d69d9113bf778.jpg[/img]\n\nBoth armors come stock standard with the Reinforced Epaulettes perk, offering your limbs the chance of not breaking so you can continue to wave the flag of victory. For maximum respect, unlock the Decorated Hero title and Lockstep emote to ensure you and your fellow Helldivers parade together on the bodies of your victories. In unison.\n\nAn intricate new look from Warbonds of past eras.\nBy popular demand, we are adding a new stash of FRV patterns to previously released Warbonds to all owners. Go check out the Viper Commando, Freedom's Flame, Chemical Agents, and Truth Enforcers Warbond pages in Acquisitions on May 15th!\n\nAre you ready to join the rank of heroes? Masters of Ceremony and your new skins march in on May 15th for PS5 and PC.\n\n[img]{STEAM_CLAN_IMAGE}/44156989/2c4624d241247611af4ca5bc24431a40be79ce92.jpg[/img]",
        "publishedAt": "2025-05-08T13:23:29Z"
    },
    {
        "id": "1795917897352210",
        "title": "Patch 01.002.203",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1795917897352210",
        "author": "Åtnjutslångsamt",
        "content": "Good Friday morning Helldivers.\nAuto Cannon update coming your way.\n\n[h1]Overview[/h1]\nBringing you the fix for the reload issues currently present in the game. We deemed this important enough to get in as fast as possible before the weekend\n[list]\n[*] Fix for the auto-cannon reload bug, it now reloads as intended\n[/list]",
        "publishedAt": "2025-04-04T09:00:32Z"
    },
    {
        "id": "1795283637975284",
        "title": "PATCH 01.002.202",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1795283637975284",
        "author": "Åtnjutslångsamt",
        "content": "Release Captain Carlberg here with a small update for you this fine April Tuesday\n\n[h1]Overview[/h1]\n[list]\n[*] Crash Fixes\n[*] Mission fix\n[*] Miscellaneous fixes\n[/list]\n[h2]Fixes[/h2]\n[b]Crash Fixes, Hangs and Soft-locks:[/b]\n[list]\n[*] Fixed game crashing on legacy hardware when player drops into a mission\n[*] Fixed crash after exiting the armory when switching from certain weapons\n[*] Fix an out-of-memory crash when large amount of particles are present\n[/list]\n[b]Weapons and Stratagems[/b]\n[list]\n[*] Fixed shooting and reloading issues with laser weapons\n[/list]\n[b]Social & Multiplayer Fixes[/b]\n[list]\n[*] Fixed an edge-case allowing some mismatching version to still connect to each other\n[/list]\n[b]Missions[/b]\n[list]\n[*] Fixed issue on Illuminate Defend Evacuation Site missions where illuminate dropships stopped coming if too many were destroyed before they dropped off the enemies.\n[/list]\n[b]Miscellaneous Fixes[/b]\n[list]\n[*] Fixed white boxes showing in seldom cases in the Super Store\n[/list]\n",
        "publishedAt": "2025-04-01T09:00:51Z"
    },
    {
        "id": "1794830911028846",
        "title": "PATCH 01.002.201",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/steam_community_announcements/1794830911028846",
        "author": "Åtnjutslångsamt",
        "content": "Freedoms greetings Helldivers, Release Captain Carlberg here.\nBringing you a small update this democratic Tuesday\n[h1]Overview[/h1]\n[list]\n[*] Crash fixes\n[*] Weapon fixes\n[*] Miscellaneous Fixes\n[/list]\n[h2]Fixes[/h2]\n[b]Crash Fixes, Hangs and Soft-locks:[/b]\n[list]\n[*] Fixed a crash that could occur when a large number of particles were displayed\n[*] Fixed a rare crash when aiming scoped weapons\n[*] Fixed some crashes when playing bot convoy missions\n[*] Fixed a crash that could occur when receiving Microsoft Teams messages while playing the game\n[/list]\n[b]Weapons and Stratagems[/b]\n[list]\n[*] Fixed an issue where the weapon flashlights were flickering while using ADS\n[*] Fixed an issue for energy based weapons not charging or overheating properly\n[*] Fixed an issue with wrong drag setting on the GL-21 Grenade Launcher projectiles that made them lose velocity faster than they should have\n[*] Fixed an issue where shrapnel from surface-hits was forced in a roughly south-west direction. Shrapnel should now properly fly out in a 180-ish arc in the direction of the surface hit\n[/list]\n[b]LAS-58 Talon[/b]\n[list]\n[*] Fixed an visual issue when reloading in ADS\n[*] Fixed an issue for not being able to reload without overheating\n[*] HUD fixes to properly show correct Ammo state\n[*] Now properly resets the temperature to 0 when reloading\n[*] Fixed a visual effect issue when holding down the fire button\n[*] Removed a minor charging delay to firing projectiles\n[/list]\nSome unintentional changes made their way onto the Liberator Concussive and the Breaker during the last patch. This is a revert of those changes.\n[b]AR-23C Liberator Concussive[/b]\n[list]\n[*] Starting magazine amount increased from 2 to 4\n[*] Max spare amount of magazines increased from 5 to 6\n[*] Ergonomic effect increased from 0 to -10\n[/list]\n[b]SG-225 Breaker [/b]\n[list]\n[*] Starting magazine amount decreased from 6 to 5\n[*] Max spare amount of magazines decreased from 10 to 7\n[/list]\n[b]Social & Multiplayer Fixes[/b]\n[list]\n[*] Resolved an issue where the Account ID was not visible in the Options tab\n[/list]\n[b]Miscellaneous Fixes[/b]\n[list]\n[*] Fixed an issue for the gas weapons, throwables and stratagems inverting the movement input for the Helldiver\n[*] The Jarndiver override for the hoverpacks has been turned off effective today. This is reserved for General Brasch and other Super 10 Star Generals(Fixed a bug with the draw and kick emotes that allowed players to stay floating in the air)\n[/list]\n\nEnd of transmission\n[i]Release Captain Carlberg out[/i]",
        "publishedAt": "2025-03-25T10:00:38Z"
    }
]